Revit 2027 API
RebarUpdateCurvesData.IsBarsNumberChanged Property
 Indicates if the bar number has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBarsNumberChanged { get; }
Public ReadOnly Property IsBarsNumberChanged As Boolean
	Get
public:
property bool IsBarsNumberChanged {
	bool get ();
}
member IsBarsNumberChanged : bool with get
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace